[
  {
    "id": 5,
    "companyName": "UEEK Agência Digital",
    "role": "Desenvolvedor Júnior",
    "workingPeriod": "Abr/2024 - Trabalho Atual",
    "description": "Como o desenvolvedor responsável por um dos projetos mobile da empresa, realizei:\n\n- Definição da arquitetura do projeto\n-Definição da documentação dos conventional commits\n-Desenvolvimento dos principal módulos do projeto.\n\nO projeto utiliza Flutter como sua principal tecnologia, mantendo um padrão próprio derivado do MVC e contando com as bibliotecas abaixo:\n- Riverpod -> Utilizado para a gerência de estado no Flutter.\n- Agora -> Utilizado para lidar com chamadas de vídeo e áudio dentro do aplicativo.\n- Dio -> Utilizado para lidar com chamadas para as APIs.",
    "skillList": [
      "Desenvolvimento de Software",
      "Arquitetura de Software",
      "Flutter",
      "Riverpod",
      "Dio",
      "Gerenciamento de Configuração",
      "Aplicativo com chamada de vídeo"
    ]
  },
  {
    "id": 4,
    "companyName": "NDD Tech",
    "role": "Estagiário SRE",
    "workingPeriod": "Nov/2023 - Abr/2024",
    "description": "Responsável por realizar uma análise do banco de dados do projeto, corrigir divergências nos registros através de uma ferramenta automatizada e monitorar os servidores e serviços do projeto.",
    "skillList": [
      "SQL",
      "Resolução de Problemas",
      "Bancos de Dados",
      "Leitura de Logs",
      "RabbitMQ"
    ]
  },
  {
    "id": 3,
    "companyName": "NDD Tech",
    "role": "Estagiário de Suporte",
    "workingPeriod": "Ago/2023 - Nov/2023",
    "description": "Responsável por atender chamados de clientes, resolver problemas com o software, realizar consultas e outros comandos em bancos de dados, comunicando com o time de desenvolvimento e de suporte e realizando consultas de Logs do software. Também desenvolvi uma automação python para automatizar algumas tarefas e depois fui transferido para SRE.",
    "skillList": [
      "SQL",
      "Resolução de Problemas",
      "Atendimento ao Cliente",
      "Bancos de Dados",
      "Leitura de Logs"
    ]
  },
  {
    "id": 2,
    "companyName": "Tokenlab Tecnologia da Informação LTDA",
    "role": "Web Developer",
    "workingPeriod": "May/2021 - Feb/2023",
    "description": "Na Tokenlab, desenvolvi alguns projetos utilizando tecnologias e conceitos como Flutter Web, Angular, HTML, CSS, SASS, DDD (Domain Driven Design), Docker, BLoC, Design Patterns e Responsive Designs. Também usei Jira extensivamente para gerenciamento de equipe, bem como Figma, Bitbucket e SCRUM e Kanban. Para melhorar meus conhecimentos, também fiz alguns treinamentos da empresa que mostraram algumas novas tecnologias como Cloud Formations e AWS, mas também treinamentos para melhorar minhas habilidades com Node.js.\n\nProjetos que participei:\n\nCinemark ATM 3.0 - Agosto/2021 - Maio/2022\n\nO Cinemark ATM 3.0 foi um dos melhores projetos que já participei, onde desenvolvi diversas telas e funcionalidades para o ATM 3.0 do Cinemark, uma máquina de autoatendimento onde o cliente pode realizar suas compras de produtos Cinemark diretamente pelo software.\n\nPara o desenvolvimento foi utilizado Flutter Web, BLoC (Business Logic Object Components), Domain Driven Design, DIO (para conexão com API) e outros conceitos e melhores práticas para o desenvolvimento em Flutter.\n\nDesenvolvi funcionalidades como: compra de ingressos para filmes, finalização do carrinho e comprovante, escolha da sessão do filme, listagem de filmes em pré-venda, em cartaz ou filmes que lançarão em breve, entre outras funcionalidades do software.\n\nAlém disso, também realizei revisões de Pull Requests feitas pelo time.\n\nMyPromo - Ago/2022 - Nov/2022.\n\nDesenvolvido com Angular, o MyPromo é um software que mostra para os usuários as promoções de estabelecimentos em sua região.\n\nMinha contribuição para o MyPromo foi menor do que no Cinemark, sendo focada mais em algumas resoluções de bugs, estudo da tecnologia e dos paradigmas usados no projeto.\n\nTokenlab Website - Nov/2022 - Fevereiro/2023.\n\nO site da Tokenlab é uma Landing Page desenvolvida com Angular, onde desenvolvi mudanças no layout, trocando componentes, reformulando a página e também realizando a tradução para o inglês.",
    "skillList": [
      "Node",
      "Typescript",
      "Angular",
      "Flutter",
      "Docker",
      "DDD",
      "BLoC",
      "SCRUM",
      "Kanban",
      "Jira",
      "Bitbucket",
      "Figma",
      "HTML",
      "CSS",
      "SASS",
      "Designs Responsivos",
      "Flutter Web",
      "Colaboração"
    ]
  },
  {
    "id": 1,
    "companyName": "IFMATH",
    "role": "FullStack Developer",
    "workingPeriod": "Fev/2020 - Abr/2021",
    "description": "Desenvolvi parte do site do IFMATH, que é um software voltado para o ensino de matemática. O software foi criado com Angular, Java Spring Boot, Git, CSS, SASS, HTML, TDD e designs responsivos.",
    "skillList": [
      "TDD",
      "Java Spring Boot",
      "Angular",
      "TypeScript",
      "Colaboração",
      "Git",
      "SASS",
      "Designs Responsivos",
      "HTML"
    ]
  }
]
