[
  {
    "id": 4,
    "companyName": "NDD Tech",
    "role": "SRE Intern",
    "workingPeriod": "Nov/2023 - Current work",
    "description": "Responsible for performing an analysis of the project database, fixing disagreements in the records through an automated tool and monitoring the project's servers and services.",
    "skillList": [
      "SQL",
      "Problem solving",
      "Clustering",
      "Database",
      "RabbitMQ"
    ]
  },
  {
    "id": 3,
    "companyName": "NDD Tech",
    "role": "Support Intern",
    "workingPeriod": "Aug/2023 - Nov/2023",
    "description": "Responsible for answering customer calls, solving problems with the software, performing queries and other commands in databases, communicating with the development and support team and performing queries of the software's Logs.",
    "skillList": [
      "SQL",
      "Problem solving",
      "Customer service",
      "Database",
      "Logs reading"
    ]
  },
  {
    "id": 1,
    "companyName": "Tokenlab Tecnologia da Informação LTDA",
    "role": "Web Developer",
    "workingPeriod": "May/2021 - Feb/2023",
    "description": "At Tokenlab, I've developed some projects using technologies and concepts like Flutter Web, Angular, HTML, CSS, SASS, DDD (Domain Driven Design), Docker, BLoC, Design Patterns and Responsive Designs. I've also used Jira extensively for team management, as well as Figma, Bitbucket, and utilized SCRUM and Kanban. To improve my knowledge, I've also done some trainings from the company that showed some new technologies like Cloud Formations and AWS but also trainings to improve my skills with Node.\n\nProjects Completed:\n\nCinemark ATM - Self-service machine for the Cinemark cinema chain. The project was developed in Flutter Web, where I learned a lot about the technology, its widgets, design patterns that improve development, and enhanced my collaborative professional skills. - Aug/2021 - May/2022.\n\nMyPromo - Website and application that aims to assist consumers with their supermarket shopping. 2022 - November 2022.\n\nTokenlab Website Maintenance. 2022 - 2023.",
    "skillList": [
      "Node",
      "Typescript",
      "Angular",
      "Flutter",
      "Docker",
      "DDD",
      "BLoC",
      "SCRUM",
      "Kanban",
      "Jira",
      "Bitbucket",
      "Figma",
      "HTML",
      "CSS",
      "SASS",
      "Responsive Designs",
      "Flutter Web",
      "Team Collaboration"
    ]
  },
  {
    "id": 2,
    "companyName": "IFMATH",
    "role": "FullStack Developer",
    "workingPeriod": "Feb/2020 - Apr/2021",
    "description": "Helping in the development of the IFMATH website, which is a software focused at teaching math. The website was made with Angular, Java Spring Boot, Git, CSS, SASS, HTML, TDD concept, and responsive designs.",
    "skillList": [
      "TDD",
      "Java Spring Boot",
      "Angular",
      "TypeScript",
      "Team Collaboration",
      "Git",
      "SASS",
      "Responsive Design",
      "HTML"
    ]
  }
]
